aleksbezruk/BMS_onMCU_BLE/QN908x/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPMod_SPI_I2C
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPMod_SPI_I2C(void)
{
    const uint32_t portA_pin3_config = (/* Selects pin function 5 */
                                        IOCON_FUNC5 |
                                        /* Selects High-Z function */
                                        IOCON_MODE_HIGHZ |
                                        /* Enable low drive strength */
                                        IOCON_DRIVE_LOW);
    /* PORTA PIN 3 (coords: 8) is configured as FC2_SDA_SSEL0 */
    IOCON_PinMuxSet(IOCON, 0U, 3U, portA_pin3_config);

    const uint32_t portA_pin4_config = (/* Selects pin function 5 */
                                        IOCON_FUNC5 |
                                        /* Selects High-Z function */
                                        IOCON_MODE_HIGHZ |
                                        /* Enable low drive strength */
                                        IOCON_DRIVE_LOW);
    /* PORTA PIN 4 (coords: 7) is configured as FC2_SDA_MOSI */
    IOCON_PinMuxSet(IOCON, 0U, 4U, portA_pin4_config);

    const uint32_t portA_pin5_config = (/* Selects pin function 5 */
                                        IOCON_FUNC5 |
                                        /* Selects High-Z function */
                                        IOCON_MODE_HIGHZ |
                                        /* Enable low drive strength */
                                        IOCON_DRIVE_LOW);
    /* PORTA PIN 5 (coords: 6) is configured as FC2_SCL_MISO */
    IOCON_PinMuxSet(IOCON, 0U, 5U, portA_pin5_config);

    const uint32_t portA_pin6_config = (/* Selects pin function 4 */
                                        IOCON_FUNC4 |
                                        /* Selects High-Z function */
                                        IOCON_MODE_HIGHZ |
                                        /* Enable low drive strength */
                                        IOCON_DRIVE_LOW);
    /* PORTA PIN 6 (coords: 5) is configured as FC1_RTS_SCL */
    IOCON_PinMuxSet(IOCON, 0U, 6U, portA_pin6_config);

    const uint32_t portA_pin7_config = (/* Selects pin function 4 */
                                        IOCON_FUNC4 |
                                        /* Selects High-Z function */
                                        IOCON_MODE_HIGHZ |
                                        /* Enable low drive strength */
                                        IOCON_DRIVE_LOW);
    /* PORTA PIN 7 (coords: 4) is configured as FC1_CTS_SDA */
    IOCON_PinMuxSet(IOCON, 0U, 7U, portA_pin7_config);

    const uint32_t portA_pin30_config = (/* Selects pin function 4 */
                                         IOCON_FUNC4 |
                                         /* Selects High-Z function */
                                         IOCON_MODE_HIGHZ |
                                         /* Enable low drive strength */
                                         IOCON_DRIVE_LOW);
    /* PORTA PIN 30 (coords: 15) is configured as FC2_SCK */
    IOCON_PinMuxSet(IOCON, 0U, 30U, portA_pin30_config);

    const uint32_t portA_pin31_config = (/* Selects pin function 5 */
                                         IOCON_FUNC5 |
                                         /* Selects High-Z function */
                                         IOCON_MODE_HIGHZ |
                                         /* Enable low drive strength */
                                         IOCON_DRIVE_LOW);
    /* PORTA PIN 31 (coords: 12) is configured as FC3_SCK */
    IOCON_PinMuxSet(IOCON, 0U, 31U, portA_pin31_config);
    const uint32_t portB_pin2_config = (/* Selects pin function 0 */
                                        IOCON_FUNC0 |
                                        /* Selects High-Z function */
                                        IOCON_MODE_HIGHZ |
                                        /* Enable low drive strength */
                                        IOCON_DRIVE_LOW);
    /* PORTB PIN 2 (coords: 33) is configured as GPIOB2 */
    IOCON_PinMuxSet(IOCON, 1U, 2U, portB_pin2_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSWD_DEBUG:
- options: {prefix: BOARD_, coreID: cm4}
- pin_list:
  - {pin_num: '23', peripheral: SWD, signal: SWCLK, pin_signal: SWCLK/GPIOA22/SCT0_IN2/CTIMER3_MAT0/FC2_SDA_SSEL0/FC3_SSEL3/QDEC1_A, pull_control: Pull_down, drive_strength: low}
  - {pin_num: '22', peripheral: SWD, signal: SWDIO, pin_signal: SWDIO/GPIOA23/SCT0_IN3/CTIMER3_MAT1/FC2_SCL_SSEL1/FC3_SSEL2/QDEC1_B, pull_control: High_Z, drive_strength: low}
  - {pin_num: '12', peripheral: SWD, signal: SWO, pin_signal: GPIOA31/DAC/RTC_CAP/CTIMER3_MAT2/SWO/FC3_SCK/SPIFI_CLK, pull_control: High_Z, drive_strength: low}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSWD_DEBUG
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitSWD_DEBUG(void)
{
    const uint32_t portA_pin22_config = (/* Selects pin function 0 */
                                         IOCON_FUNC0 |
                                         /* Selects pull-down function */
                                         IOCON_MODE_PULLDOWN |
                                         /* Enable low drive strength */
                                         IOCON_DRIVE_LOW);
    /* PORTA PIN 22 (coords: 23) is configured as SWCLK */
    IOCON_PinMuxSet(IOCON, 0U, 22U, portA_pin22_config);

    const uint32_t portA_pin23_config = (/* Selects pin function 0 */
                                         IOCON_FUNC0 |
                                         /* Selects High-Z function */
                                         IOCON_MODE_HIGHZ |
                                         /* Enable low drive strength */
                                         IOCON_DRIVE_LOW);
    /* PORTA PIN 23 (coords: 22) is configured as SWDIO */
    IOCON_PinMuxSet(IOCON, 0U, 23U, portA_pin23_config);

    const uint32_t portA_pin31_config = (/* Selects pin function 4 */
                                         IOCON_FUNC4 |
                                         /* Selects High-Z function */
                                         IOCON_MODE_HIGHZ |
                                         /* Enable low drive strength */
                                         IOCON_DRIVE_LOW);
    /* PORTA PIN 31 (coords: 12) is configured as SWO */
    IOCON_PinMuxSet(IOCON, 0U, 31U, portA_pin31_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitETM_TRACE:
- options: {prefix: BOARD_, coreID: cm4}
- pin_list:
  - {pin_num: '16', peripheral: ETM, signal: 'ETM_TRACEDATA, 2', pin_signal: GPIOA29/ACMP1N/ETM_TRACEDAT2/CTIMER3_MAT0/FC2_SCK/FC3_MISO/SPIFI_IO2, pull_control: High_Z,
    drive_strength: low}
  - {pin_num: '17', peripheral: ETM, signal: ETM_TRACECLK, pin_signal: GPIOA28/CLK_AHB/ETM_TRACECLK/RTC_CAP/FC1_SCK/SD_DAC/SPIFI_CSN, pull_control: High_Z, drive_strength: low}
  - {pin_num: '15', peripheral: ETM, signal: 'ETM_TRACEDATA, 3', pin_signal: GPIOA30/ACMP1P/ETM_TRACEDAT3/CTIMER3_MAT1/FC2_SCK/FC3_MOSI/SPIFI_IO3, pull_control: High_Z,
    drive_strength: low}
  - {pin_num: '21', peripheral: ETM, signal: 'ETM_TRACEDATA, 0', pin_signal: GPIOA24/ACMP0N/CS6/ETM_TRACEDAT0/CTIMER3_CAP0/RFE_RX_EN/FC3_SSEL1/SPIFI_IO0, pull_control: High_Z,
    drive_strength: low}
  - {pin_num: '20', peripheral: ETM, signal: 'ETM_TRACEDATA, 1', pin_signal: GPIOA25/ACMP0P/CS7/ETM_TRACEDAT1/CTIMER3_CAP1/RFE_TX_EN/FC3_SSEL0/SPIFI_IO1, pull_control: High_Z,
    drive_strength: low}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

